{
  "_attn_implementation_autoset": true,
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Infeksi Kulit",
    "1": "Eksim",
    "2": "Jerawat",
    "3": "Gangguan Pigmentasi",
    "4": "Tumor Kulit Jinak",
    "5": "Kanker Kulit (Maligna)",
    "6": "Jerawat (Acne)",
    "7": "Keratosis Aktinik (Pra-Kanker)",
    "8": "Karsinoma Sel Basal",
    "9": "Keratosis Jinak",
    "10": "Dermatofibroma",
    "11": "Nevus Melanositik (Tahi Lalat)",
    "12": "Melanoma",
    "13": "Lesi Vaskular (Pembuluh Darah)",
    "14": "Kutil/Molluscum"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Infeksi Kulit": 0,
    "Eksim": 1,
    "Jerawat": 2,
    "Gangguan Pigmentasi": 3,
    "Tumor Kulit Jinak": 4,
    "Kanker Kulit (Maligna)": 5,
    "Jerawat (Acne)": 6,
    "Keratosis Aktinik (Pra-Kanker)": 7,
    "Karsinoma Sel Basal": 8,
    "Keratosis Jinak": 9,
    "Dermatofibroma": 10,
    "Nevus Melanositik (Tahi Lalat)": 11,
    "Melanoma": 12,
    "Lesi Vaskular (Pembuluh Darah)": 13,
    "Kutil/Molluscum": 14
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.1",
  "num_labels": 15
}